Hello @BBBmau, the output is very weird. In our case, we are using `kubernetes_manifest` to create a knative Service. It just says "must be replaced" but no reason, see below:

```
  # module.api.kubernetes_manifest.api_knative must be replaced
-/+ resource "kubernetes_manifest" "api_knative" {
      + computed_fields = [
          + "spec.template.metadata.annotations",
          + "metadata.annotations",
        ]
      + manifest        = {
          + apiVersion = "serving.knative.dev/v1"
          + kind       = "Service"
          + metadata   = {
              + name      = "api-knative"
              + namespace = "example"
            }
          + spec       = {
              + template = {
                  + metadata = {
                      + annotations = {
                          + "autoscaling.knative.dev/class"                  = "kpa.autoscaling.knative.dev"
                          + "autoscaling.knative.dev/max-scale"              = "15"
                          + "autoscaling.knative.dev/metric"                 = "concurrency"
                          + "autoscaling.knative.dev/min-scale"              = "2"
                          + "autoscaling.knative.dev/target"                 = "5"
                          + "cluster-autoscaler.kubernetes.io/safe-to-evict" = "true"
                        }
                    }
                  + spec     = {
                      + containers = [
                          + {
                              + env             = [
                                  + {
                                      + name  = "SERVE_MEDIA_DIRECTLY"
                                      + value = "False"
                                    },
                                ]
                              + image           = "example-image:latest"
                              + imagePullPolicy = "IfNotPresent"
                              + name            = "api"
                              + ports           = [
                                  + {
                                      + containerPort = 80
                                    },
                                ]
                              + resources       = {
                                  + limits   = {
                                      + cpu    = "1"
                                      + memory = "512M"
                                    }
                                  + requests = {
                                      + cpu    = "500m"
                                      + memory = "256M"
                                    }
                                }
                            },
                        ]
                    }
                }
            }
        }
      ~ object          = {
          ~ metadata   = {
              ~ annotations                = {
                  - "serving.knative.dev/creator"      = "104994254503627360979"
                  - "serving.knative.dev/lastModifier" = "104994254503627360979"
                } -> (known after apply)
              ~ clusterName                = null -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "api-knative"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ template = {
                  ~ metadata = {
                      ~ annotations = {
                          - "autoscaling.knative.dev/class"                  = "kpa.autoscaling.knative.dev"
                          - "autoscaling.knative.dev/max-scale"              = "15"
                          - "autoscaling.knative.dev/metric"                 = "concurrency"
                          - "autoscaling.knative.dev/min-scale"              = "2"
                          - "autoscaling.knative.dev/target"                 = "5"
                          - "client.knative.dev/updateTimestamp"             = "2022-11-15T10:28:08Z"
                          - "cluster-autoscaler.kubernetes.io/safe-to-evict" = "true"
                        } -> (known after apply)
                      ~ finalizers  = null -> (known after apply)
                      ~ labels      = null -> (known after apply)
                      ~ name        = null -> (known after apply)
                      ~ namespace   = null -> (known after apply)
                    }
                  ~ spec     = {
                      ~ automountServiceAccountToken = null -> (known after apply)
                      ~ containerConcurrency         = 0 -> (known after apply)
                      ~ containers                   = [
                          ~ {
                              ~ args                     = null -> (known after apply)
                              ~ command                  = null -> (known after apply)
                              ~ env                      = [
                                  ~ {
                                        name      = "SERVE_MEDIA_DIRECTLY"
                                      ~ valueFrom = {
                                          ~ configMapKeyRef = {
                                              ~ key      = null -> (known after apply)
                                              ~ name     = null -> (known after apply)
                                              ~ optional = null -> (known after apply)
                                            }
                                          ~ fieldRef        = {
                                              ~ apiVersion = null -> (known after apply)
                                              ~ fieldPath  = null -> (known after apply)
                                            }
                                          ~ secretKeyRef    = {
                                              ~ key      = null -> (known after apply)
                                              ~ name     = null -> (known after apply)
                                              ~ optional = null -> (known after apply)
                                            }
                                        }
                                        # (1 unchanged element hidden)
                                    },
                                ]
                              ~ envFrom                  = null -> (known after apply)
                              ~ lifecycle                = null -> (known after apply)
                                name                     = "api"
                              ~ ports                    = [
                                  ~ {
                                      ~ name          = null -> (known after apply)
                                      ~ protocol      = "TCP" -> (known after apply)
                                        # (1 unchanged element hidden)
                                    },
                                ]
                              ~ securityContext          = {
                                  ~ capabilities           = {
                                      ~ drop = null -> (known after apply)
                                    }
                                  ~ readOnlyRootFilesystem = null -> (known after apply)
                                  ~ runAsGroup             = null -> (known after apply)
                                  ~ runAsNonRoot           = null -> (known after apply)
                                  ~ runAsUser              = null -> (known after apply)
                                }
                              ~ terminationMessagePath   = null -> (known after apply)
                              ~ terminationMessagePolicy = null -> (known after apply)
                              ~ workingDir               = null -> (known after apply)
                                # (3 unchanged elements hidden)
                            },
                        ]
                      ~ enableServiceLinks           = false -> (known after apply)
                      ~ imagePullSecrets             = null -> (known after apply)
                      ~ serviceAccountName           = null -> (known after apply)
                      ~ timeoutSeconds               = 300 -> (known after apply)
                    }
                }
              ~ traffic  = [
                  - {
                      - configurationName = null
                      - latestRevision    = true
                      - percent           = 100
                      - revisionName      = null
                      - tag               = null
                      - url               = null
                    },
                ] -> (known after apply)
            }
            # (2 unchanged elements hidden)
        }

      + field_manager {
          + force_conflicts = true
        }
    }

```